---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager
source: html/fef82f72-aea9-3389-e972-a4826fc29d7e.htm
---
# AnalyticalToPhysicalAssociationManager Methods

Adds a new association between an analytical element and a physical element.